AL-Steady/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    rightSide
    {
        type            calculated;
        value           uniform 0;
    }

    leftSide
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    container
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    spoiler
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ground
    {
        type 			atmNutkWallFunction;
		z0				uniform 0.017;
		value			uniform 0.017;
		kappa			0.41;
		Cmu				0.09;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }

}


// ************************************************************************* //
