AL-Steady/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set the number of parallel processors you intend to run the simulation on
numberOfSubdomains  100;

method      hierarchical;
distributor     ptscotch;
// distributor     zoltan;
// libs            ("libzoltanDecomp.so");

hierarchicalCoeffs
{
    // Break up the domain in x, y, and z chunks, this needs to equal the numberOfSubdomains
    n               (10 5 2); 
    order           xyz;
}

zoltanCoeffs
{
    lb_method       hypergraph;
    lb_approach     partition;
}


// ************************************************************************* //
